Revit 2026 API

# SweptProfile Class

---

Represents an extruded profile swept along a driving curve.

SystemObject Autodesk.Revit.DBSweptProfile

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SweptProfile : IDisposable
```
```vb
Public Class SweptProfile
	Implements IDisposable
```
```cpp
public ref class SweptProfile : IDisposable
```
```fsharp
type SweptProfile =
    class
        interface IDisposable
    end
```

The SweptProfile type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EndSetBack | The distance from the end of the driving curve to the point where the sweep actually ends. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | StartSetBack | The distance from the start of the driving curve to the point where the sweep actually begins. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the SweptProfile |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDrivingCurve | Provides access to the curve that dictates the path of the swept profile. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSweptProfile | Returns an object that describes the profile that is swept along the driving curve. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Elements such as beams may be formed from a profile that has been swept along a curve. This class represents such a form and is used to access the cross section and the underlying curve that make up the Element.

#### Reference

Autodesk.Revit.DB Namespace